tap "candid82/brew"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jondot/tap"
tap "koekeishiya/formulae"
tap "reviewdog/tap"
tap "schpet/tap"
tap "xcodesorg/made"
tap "yqrashawn/goku"
brew "asdf"
brew "atuin"
brew "bat"
brew "cloud-sql-proxy"
brew "ripgrep"
brew "codex"
brew "expect"
brew "extract_url"
brew "libevent"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "git"
brew "golangci-lint"
brew "jq"
brew "mas"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "openjdk"
brew "openssl@1.1"
brew "pkgconf"
brew "reattach-to-user-namespace"
brew "starship"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "urlview"
brew "uv"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform", link: false
brew "jondot/tap/hygen"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "reviewdog/tap/reviewdog"
brew "xcodesorg/made/xcodes"
brew "yqrashawn/goku/goku"
cask "alacritty"
cask "claude"
cask "claude-code"
cask "cursor"
cask "deepl"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "gcloud-cli"
cask "karabiner-elements"
cask "kiro"
cask "krisp"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "tableplus"
cask "tailscale-app"
cask "visual-studio-code"
cask "windsurf"
cask "xnapper"
cask "zoom"
mas "Xcode", id: 497799835
vscode "3w36zj6.textlint"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "aldijav.golangwithdidi"
vscode "aprilandjan.vscode-node-debug-process-picker"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "clinyong.vscode-css-modules"
vscode "connor4312.esbuild-problem-matchers"
vscode "dariofuzinato.vue-peek"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "infeng.vscode-react-typescript"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "jaakko.black"
vscode "letmaik.git-tree-compare"
vscode "mikebovenlander.formate"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "neonxp.gotools"
vscode "nhoizey.gremlins"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rooveterinaryinc.roo-cline"
vscode "rvest.vs-code-prettier-eslint"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "simonsiefke.svg-preview"
vscode "starkwang.markdown"
vscode "streetsidesoftware.code-spell-checker"
vscode "stunning.ts-debugger"
vscode "stylelint.vscode-stylelint"
vscode "sysoev.vscode-open-in-github"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zenn.zenn-preview"
vscode "zxh404.vscode-proto3"
