tap "candid82/brew"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jondot/tap"
tap "koekeishiya/formulae"
tap "reviewdog/tap"
tap "xcodesorg/made"
tap "yqrashawn/goku"
brew "asdf"
brew "bat"
brew "cloud-sql-proxy"
brew "docker"
brew "expect"
brew "extract_url"
brew "libevent"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "openssl@1.1"
brew "reattach-to-user-namespace"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "urlview"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "jondot/tap/hygen"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "reviewdog/tap/reviewdog"
brew "xcodesorg/made/xcodes"
brew "yqrashawn/goku/goku"
cask "deepl"
cask "figma"
cask "google-cloud-sdk"
cask "karabiner-elements"
cask "postman"
cask "raycast"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "aldijav.golangwithdidi"
vscode "bradlc.vscode-tailwindcss"
vscode "dariofuzinato.vue-peek"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "infeng.vscode-react-typescript"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "letmaik.git-tree-compare"
vscode "mikebovenlander.formate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "neonxp.gotools"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rvest.vs-code-prettier-eslint"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sysoev.vscode-open-in-github"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zxh404.vscode-proto3"
